app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "beingadrian"], ["email", "dev@beingadrian.com"], ["created_at", "2016-01-25 22:33:17.302784"], ["updated_at", "2016-01-25 22:33:17.302784"]]